Revit 2027 API
BuiltInFailures.GroupFailures.GroupCannotMixBackAndForegroundDetail Property
 This detail group contains some elements which display in the background and some which display in the foreground. Detail groups must be able to be displayed as a unit in either the foreground or background, so this type of mixture is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupCannotMixBackAndForegroundDetail { get; }
Public Shared ReadOnly Property GroupCannotMixBackAndForegroundDetail As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupCannotMixBackAndForegroundDetail {
	FailureDefinitionId^ get ();
}
static member GroupCannotMixBackAndForegroundDetail : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace